#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: logica0419, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113601809604]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113601809610]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113601809608]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113601809588]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113601809609]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113601809593]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113601809587]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113601809589]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113601809594]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113601809606]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113601809586]
data.sakuracloud_archive.ubuntu_archive: Reading...
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113600510456]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113601809596]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113601809597]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113601809591]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113601809592]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113601809598]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113601809600]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113601809612]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113601809601]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113601809595]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113601809602]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113601809607]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113601809613]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113601809641]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113601809619]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113601809655]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113601809660]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113601809638]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113601809637]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113601809640]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113601809642]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113601809639]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113601809620]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113601809621]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113601809632]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=19805]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601809591" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113601809619" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601809592" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113601809620" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601809596" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113601809621" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                   = "113601809597" -> (known after apply)
        name                 = "k8s-dev-router-1"
      ~ server_id            = "113601809632" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601809607" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113601809639" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601809613" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113601809642" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601809612" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113601809638" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601809601" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113601809637" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601809602" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113601809655" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601809595" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113601809660" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601809598" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113601809640" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601809600" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113601809641" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601809591",
        ] -> (known after apply)
        id                = "113601809619"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601809592",
        ] -> (known after apply)
        id                = "113601809620"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601809596",
        ] -> (known after apply)
        id                = "113601809621"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks             = [
          - "113601809597",
        ] -> (known after apply)
        id                = "113601809632"
        name              = "k8s-dev-router-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601809607",
          - "113601809609",
        ] -> (known after apply)
        id                = "113601809639"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601809613",
          - "113601809606",
        ] -> (known after apply)
        id                = "113601809642"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601809612",
          - "113601809589",
        ] -> (known after apply)
        id                = "113601809638"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601809601",
          - "113601809594",
        ] -> (known after apply)
        id                = "113601809637"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601809602",
          - "113601809593",
        ] -> (known after apply)
        id                = "113601809655"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601809595",
          - "113601809608",
        ] -> (known after apply)
        id                = "113601809660"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601809598",
          - "113601809610",
        ] -> (known after apply)
        id                = "113601809640"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601809600",
          - "113601809604",
        ] -> (known after apply)
        id                = "113601809641"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 12 to add, 12 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>